Запрос = Новый Запрос;
Запрос.Параметры.Вставить("Ссылка", Склад);
Запрос.Текст = 
	
"ВЫБРАТЬ РАЗРЕШЕННЫЕ
|	Склады.ПодразделениеОрганизации,
|	Склады.ПодразделениеОрганизации.Владелец КАК ПодразделениеОрганизацииВладелец
|ИЗ
|	Справочник.Склады КАК Склады
|ГДЕ
|	Склады.Ссылка = &Ссылка";
 
Результат = Запрос.Выполнить().Выбрать();
Результат.Следующий();
	 
ПодразделениеОрганизации = Результат.ПодразделениеОрганизации;
ПодразделениеОрганизацииВладелец = Результат.ПодразделениеОрганизацииВладелец;

Если ПодразделениеОрганизацииВладелец = Объект.Организация Тогда
	Подразделение = ПодразделениеОрганизации;
Иначе
	Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
КонецЕсли;
