ВЫБРАТЬ
	ОприходованиеТоваровТовары.Номенклатура,
	СУММА(ОприходованиеТоваровТовары.Количество) КАК Количество,
	ОприходованиеТоваровТовары.Цена,
	СУММА(ОприходованиеТоваровТовары.Сумма) КАК Сумма
ПОМЕСТИТЬ ВТ_ТабличнаяЧасть
ИЗ
	Документ.ОприходованиеТоваров.Товары КАК ОприходованиеТоваровТовары
		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОприходованиеТоваров КАК ОприходованиеТоваров
		ПО ОприходованиеТоваровТовары.Ссылка = ОприходованиеТоваров.Ссылка
ГДЕ
	ОприходованиеТоваров.Ссылка = &Ссылка
	И ОприходованиеТоваровТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)

СГРУППИРОВАТЬ ПО
	ОприходованиеТоваровТовары.Номенклатура,
	ОприходованиеТоваровТовары.Цена
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ВТ_ТабличнаяЧасть.Номенклатура,
	ВТ_ТабличнаяЧасть.Количество,
	ВТ_ТабличнаяЧасть.Сумма КАК Сумма,
	ВТ_ТабличнаяЧасть.Цена КАК Цена,
	ВТ_ТабличнаяЧасть.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
ИЗ
	ВТ_ТабличнаяЧасть КАК ВТ_ТабличнаяЧасть
