ВЫБРАТЬ
	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	ВложенныйЗапрос.Цена КАК Цена,
	ВложенныйЗапрос.СтавкаНДС КАК СтавкаНДС,
	СУММА(ВложенныйЗапрос.Количество) КАК Количество,
	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма,
	СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС
ПОМЕСТИТЬ ВТ_ТабличнаяЧасть
ИЗ
	(ВЫБРАТЬ
		ОтчетОРозничныхПродажахТовары.Номенклатура КАК Номенклатура,
		ОтчетОРозничныхПродажахТовары.Цена КАК Цена,
		ОтчетОРозничныхПродажахТовары.СтавкаНДС КАК СтавкаНДС,
		СУММА(ОтчетОРозничныхПродажахТовары.Количество) КАК Количество,
		СУММА(ОтчетОРозничныхПродажахТовары.Сумма) КАК Сумма,
		СУММА(ОтчетОРозничныхПродажахТовары.СуммаНДС) КАК СуммаНДС
	ИЗ
		Документ.ОтчетОРозничныхПродажах.Товары КАК ОтчетОРозничныхПродажахТовары
			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
			ПО ОтчетОРозничныхПродажахТовары.Ссылка = ОтчетОРозничныхПродажах.Ссылка
	ГДЕ
		ОтчетОРозничныхПродажах.Ссылка = &Ссылка
	
	СГРУППИРОВАТЬ ПО
		ОтчетОРозничныхПродажахТовары.Номенклатура,
		ОтчетОРозничныхПродажахТовары.СтавкаНДС,
		ОтчетОРозничныхПродажахТовары.Цена
	
	ОБЪЕДИНИТЬ ВСЕ
	
	ВЫБРАТЬ
		ОтчетОРозничныхПродажахВозвращенныеТовары.Номенклатура,
		ОтчетОРозничныхПродажахВозвращенныеТовары.Цена,
		ОтчетОРозничныхПродажахВозвращенныеТовары.СтавкаНДС,
		СУММА(-ОтчетОРозничныхПродажахВозвращенныеТовары.Количество),
		СУММА(-ОтчетОРозничныхПродажахВозвращенныеТовары.Сумма),
		СУММА(-ОтчетОРозничныхПродажахВозвращенныеТовары.СуммаНДС)
	ИЗ
		Документ.ОтчетОРозничныхПродажах.ВозвращенныеТовары КАК ОтчетОРозничныхПродажахВозвращенныеТовары
			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
			ПО ОтчетОРозничныхПродажахВозвращенныеТовары.Ссылка = ОтчетОРозничныхПродажах.Ссылка
	ГДЕ
		ОтчетОРозничныхПродажах.Ссылка = &Ссылка
	
	СГРУППИРОВАТЬ ПО
		ОтчетОРозничныхПродажахВозвращенныеТовары.Номенклатура,
		ОтчетОРозничныхПродажахВозвращенныеТовары.СтавкаНДС,
		ОтчетОРозничныхПродажахВозвращенныеТовары.Цена) КАК ВложенныйЗапрос

СГРУППИРОВАТЬ ПО
	ВложенныйЗапрос.Номенклатура,
	ВложенныйЗапрос.Цена,
	ВложенныйЗапрос.СтавкаНДС
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ВТ_ТабличнаяЧасть.Номенклатура КАК Номенклатура,
	ВТ_ТабличнаяЧасть.Количество КАК Количество,
	ВТ_ТабличнаяЧасть.Сумма КАК Сумма,
	ВТ_ТабличнаяЧасть.СтавкаНДС КАК СтавкаНДС,
	ВТ_ТабличнаяЧасть.СуммаНДС КАК СуммаНДС,
	СебестоимостьНоменклатурыСрезПоследних.Цена * ВТ_ТабличнаяЧасть.Количество КАК Себестоимость,
	ВТ_ТабличнаяЧасть.Цена КАК Цена
ИЗ
	ВТ_ТабличнаяЧасть КАК ВТ_ТабличнаяЧасть
		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СебестоимостьНоменклатуры.СрезПоследних(&Период, Магазин = &Магазин) КАК СебестоимостьНоменклатурыСрезПоследних
		ПО ВТ_ТабличнаяЧасть.Номенклатура = СебестоимостьНоменклатурыСрезПоследних.Номенклатура
