ВЫБРАТЬ
	СписаниеТоваровТовары.Номенклатура,
	СУММА(СписаниеТоваровТовары.Количество) КАК Количество,
	СписаниеТоваровТовары.Цена,
	СУММА(СписаниеТоваровТовары.Сумма) КАК Сумма
ПОМЕСТИТЬ ВТ_ТабличнаяЧасть
ИЗ
	Документ.СписаниеТоваров.Товары КАК СписаниеТоваровТовары
		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеТоваров КАК СписаниеТоваров
		ПО СписаниеТоваровТовары.Ссылка = СписаниеТоваров.Ссылка
ГДЕ
	СписаниеТоваров.Ссылка = &Ссылка
	И СписаниеТоваровТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)

СГРУППИРОВАТЬ ПО
	СписаниеТоваровТовары.Номенклатура,
	СписаниеТоваровТовары.Цена
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ВТ_ТабличнаяЧасть.Номенклатура,
	ВТ_ТабличнаяЧасть.Количество,
	ВТ_ТабличнаяЧасть.Сумма КАК Себестоимость,
	ВТ_ТабличнаяЧасть.Сумма КАК Сумма,
	ВТ_ТабличнаяЧасть.Цена КАК Цена,
	ВТ_ТабличнаяЧасть.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
ИЗ
	ВТ_ТабличнаяЧасть КАК ВТ_ТабличнаяЧасть
