Запрос = Новый Запрос("ВЫБРАТЬ
|	ДоговорыКонтрагентов.Ссылка
|ИЗ
|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
|ГДЕ
|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
|	И ДоговорыКонтрагентов.Организация = &Организация
|	И ДоговорыКонтрагентов.Владелец = &Владелец
|	И ДоговорыКонтрагентов.ВалютаВзаиморасчетов = &ВалютаВзаиморасчетов
|	И НЕ ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах
|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
|	И ДоговорыКонтрагентов.ЭтоГруппа = &ЭтоГруппа");
Для Каждого СвойствоПоиска Из СвойстваПоиска Цикл 
	Запрос.УстановитьПараметр(СвойствоПоиска.Ключ, СвойствоПоиска.Значение);
КонецЦикла;
Запрос.УстановитьПараметр("ВалютаВзаиморасчетов", Параметры.ВалютаРегламентированногоУчета);
ВыборкаДоговоров = Запрос.Выполнить().Выбрать();
Если ВыборкаДоговоров.Следующий() Тогда
	СсылкаНаОбъект = ВыборкаДоговоров.Ссылка;
КонецЕсли;
ПрекратитьПоиск = Истина;
