ТекстСообщенияЗаписи = "";
ТекстСообщенияОшибки = "";
Сообщить("Начало проведения: "+ТекущаяДата());

Для каждого СтрокаТч Из Параметры.ТаблицаДокументов Цикл
    Если СтрокаТч.Действие = "Проведение" Тогда
        ДокОбъект = СтрокаТч.Ссылка.ПолучитьОбъект();
		Попытка 
			Если ДокОбъект.ПометкаУдаления 
				И ЗначениеЗаполнено(ДокОбъект.ССылка) Тогда 
				ДокОбъект.УстановитьПометкуУдаления(Ложь); 
			КонецЕсли;
        	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
//			Сообщить("Проведен");
		Исключение    
			ДокОбъект.Записать();
//			Сообщить("Записан");
		КонецПопытки;
	ИначеЕсли СтрокаТч.Действие = "Удаление" Тогда
        ДокОбъект = СтрокаТч.Ссылка.ПолучитьОбъект();
		Если ЗначениеЗаполнено(ДокОбъект.ССылка) Тогда
			ДокОбъект.УстановитьПометкуУдаления(Истина); 
		КонецЕсли;	
	КонецЕсли;
КонецЦикла;

Сообщить("Завершение проведения: "+ТекущаяДата());
