ВЫБРАТЬ
	ОрдерНаПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
	СУММА(ОрдерНаПеремещениеТоваровТовары.Количество) КАК Количество,
	ОрдерНаПеремещениеТоваровТовары.Цена КАК Цена,
	СУММА(ОрдерНаПеремещениеТоваровТовары.Сумма) КАК Сумма
ПОМЕСТИТЬ ВТ_ТабличнаяЧасть
ИЗ
	Документ.ОрдерНаПеремещениеТоваров.Товары КАК ОрдерНаПеремещениеТоваровТовары
		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОрдерНаПеремещениеТоваров КАК ОрдерНаПеремещениеТоваров
		ПО ОрдерНаПеремещениеТоваровТовары.Ссылка = ОрдерНаПеремещениеТоваров.Ссылка
ГДЕ
	ОрдерНаПеремещениеТоваров.Ссылка = &Ссылка
	И ОрдерНаПеремещениеТоваровТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)

СГРУППИРОВАТЬ ПО
	ОрдерНаПеремещениеТоваровТовары.Номенклатура,
	ОрдерНаПеремещениеТоваровТовары.Цена
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ВТ_ТабличнаяЧасть.Номенклатура КАК Номенклатура,
	ВТ_ТабличнаяЧасть.Количество КАК Количество,
	ВТ_ТабличнаяЧасть.Цена * ВТ_ТабличнаяЧасть.Количество КАК Себестоимость,
	ВТ_ТабличнаяЧасть.Цена * ВТ_ТабличнаяЧасть.Количество КАК Сумма,
	ВТ_ТабличнаяЧасть.Цена КАК Цена,
	ВТ_ТабличнаяЧасть.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
ИЗ
	ВТ_ТабличнаяЧасть КАК ВТ_ТабличнаяЧасть
		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СебестоимостьНоменклатуры.СрезПоследних(&Период, Магазин = &Магазин) КАК СебестоимостьНоменклатурыСрезПоследних
		ПО ВТ_ТабличнаяЧасть.Номенклатура = СебестоимостьНоменклатурыСрезПоследних.Номенклатура
