Отказ = Ложь;
Если ЗначениеЗаполнено(Параметры.Организация) Тогда
	
	Если ЗначениеЗаполнено(Объект.Организация.ГоловнаяОрганизация) Тогда
		Организация = Объект.Организация.ГоловнаяОрганизация;
	Иначе
		Организация = Объект.Организация;
	КонецЕсли;	
	
	Если НЕ Организация = Параметры.Организация Тогда
		Отказ = Истина;
	КонецЕсли;	
КонецЕсли;	

Если ЗначениеЗаполнено(Параметры.Магазин)
	И НЕ Объект.Магазин = Параметры.Магазин Тогда
	Отказ = Истина;
КонецЕсли;	

Если НЕ Отказ Тогда
	Запросы.ОперацияБух.УстановитьПараметр("Ссылка", Объект.Ссылка);
	РезультатыЗапроса = Запросы.ОперацияБух.Выполнить();
	ВыборкаРезультатЗапроса =  РезультатыЗапроса.Выбрать();
	Если ВыборкаРезультатЗапроса.Следующий() Тогда
		ВходящиеДанные = Новый Структура;
		ВыгрузитьПоПравилу(ВыборкаРезультатЗапроса, , , , "ОперацияБух");
	КонецЕсли;	
КонецЕсли;
