ВЫБРАТЬ
	ОтчетОРозничныхПродажах.Ссылка,
	ОтчетОРозничныхПродажах.Магазин,
	ОтчетОРозничныхПродажах.Организация,
	ОтчетОРозничныхПродажах.Номер,
	ОтчетОРозничныхПродажах.Дата,
	СУММА(ОтчетОРозничныхПродажахОплатаПлатежнымиКартами.Сумма) КАК СуммаОперации,
	Подстрока(ОтчетОРозничныхПродажах.Комментарий,1,100) КАК Комментарий,
	ОтчетОРозничныхПродажах.Проведен,
	ОтчетОРозничныхПродажах.ПометкаУдаления
ИЗ
	Документ.ОтчетОРозничныхПродажах.ОплатаПлатежнымиКартами КАК ОтчетОРозничныхПродажахОплатаПлатежнымиКартами
		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
		ПО ОтчетОРозничныхПродажахОплатаПлатежнымиКартами.Ссылка = ОтчетОРозничныхПродажах.Ссылка
ГДЕ
	ОтчетОРозничныхПродажах.Ссылка = &Ссылка

СГРУППИРОВАТЬ ПО
	ОтчетОРозничныхПродажах.Ссылка,
	ОтчетОРозничныхПродажах.Магазин,
	ОтчетОРозничныхПродажах.Организация,
	ОтчетОРозничныхПродажах.Номер,
	ОтчетОРозничныхПродажах.Дата,
	Подстрока(ОтчетОРозничныхПродажах.Комментарий,1,100),
	ОтчетОРозничныхПродажах.Проведен,
	ОтчетОРозничныхПродажах.ПометкаУдаления
