Если ОбщегоНазначения.ЕстьРеквизитДокумента("ПодразделениеОрганизации", Объект.Метаданные()) Тогда
	Если ЗначениеЗаполнено(Объект.Склад) Тогда
		Склад = Объект.Склад;
		Подразделение =  Неопределено;
		Выполнить (Алгоритмы.ПолучитьПодразделение);
		Объект.ПодразделениеОрганизации = Подразделение;
	Иначе
		Объект.ПодразделениеОрганизации = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
	КонецЕсли;
КонецЕсли;

Выполнить(Алгоритмы.ОбработатьЗаписьДокументаПослеЗагрузки);
Объект.СуммаДокумента = Объект.Товары.Итог("Сумма");
ЗаполнениеДокументовПоУмолчанию.ЗаполнитьСчетаПоУмолчанию(Объект);

Объект.Ответственный = Справочники.Пользователи.НайтиПоНаименованию("Пользователь в рознице");
Выполнить(Алгоритмы.ПослеЗагрузкиДокумента_УстановитьССылку);
