Если НЕ ОбъектНайден Тогда
	ИмяМенеджера = Объект.Метаданные().Имя;
	СтрокаУИД = ПараметрыОбъекта["УИД"];         
//	Сообщить("СтрокаУИД:"+СтрокаУИД);
	УИД = Новый УникальныйИдентификатор(СтрокаУИД);
	ССылкаДокумента = Документы[ИмяМенеджера].ПолучитьССылку(УИД);
	Объект.УстановитьССылкуНового(ССылкаДокумента);
Иначе
	ССылкаДокумента = Объект.Ссылка;
КонецЕсли;

НоваяСтрока =  Параметры.ТаблицаДокументов.Добавить();
НоваяСтрока.Ссылка 			= ССылкаДокумента;
НоваяСтрока.Номер 			= Объект.Номер;
НоваяСтрока.Дата 			= Объект.Дата;
НоваяСтрока.МетаданныеИмя 	= Объект.Метаданные().Имя;

Если ПараметрыОбъекта["Проведен"] Тогда
    НоваяСтрока.Действие = "Проведение";
ИначеЕсли ПараметрыОбъекта["ПометкаУдаления"] Тогда	
    НоваяСтрока.Действие = "Удаление";
КонецЕсли;
