Запросы.ОтчетОРозничныхПродажахПоСебестоимости.УстановитьПараметр("Ссылка", Источник.Ссылка);
Запросы.ОтчетОРозничныхПродажахПоСебестоимости.УстановитьПараметр("Магазин", Источник.Магазин);
Запросы.ОтчетОРозничныхПродажахПоСебестоимости.УстановитьПараметр("Период", КонецМесяца(Источник.Дата));

РезультатыЗапроса = Запросы.ОтчетОРозничныхПродажахПоСебестоимости.Выполнить();
ВходящиеДанные = Новый Структура;
ВходящиеДанные.Вставить("Товары", РезультатыЗапроса.Выгрузить());
ВходящиеДанные.Вставить("Субконто", lvОбщегоНазначенияСервер.ПолучитьДопРеквизитМагазина(Источник.Магазин, "Отчет продаж Номенклатурная группа"));
