//Сообщить("НачалоПослеЗагрузки");
Объект.УчитыватьНДС = ложь;

Если ОбщегоНазначения.ЕстьРеквизитДокумента("ПодразделениеОрганизации", Объект.Метаданные()) Тогда
	Если ЗначениеЗаполнено(Объект.Склад) Тогда
		Склад = Объект.Склад;
		Подразделение =  Неопределено;
		Выполнить (Алгоритмы.ПолучитьПодразделение);
		Объект.ПодразделениеОрганизации = Подразделение;
	Иначе
		Объект.ПодразделениеОрганизации = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
	КонецЕсли;
КонецЕсли;

Выполнить(Алгоритмы.ОбработатьЗаписьДокументаПослеЗагрузки);
Выполнить(Алгоритмы.ЗаполнитьВалютуДокумента);

ЗаполнениеДокументовПоУмолчанию.ЗаполнитьСчетаПоУмолчанию(Объект);
Объект.ЗаполнитьСчетаУчетаВТабЧасти(Объект.Товары, "Товары", Истина, Истина);
Объект.ЗаполнитьСчетаУчетаВТабЧасти(Объект.Услуги, "Услуги", Истина, Истина);
Объект.СуммаДокумента = УчетНДС.ПолучитьСуммуДокументаСНДС(Объект);	
Объект.Ответственный = Справочники.Пользователи.НайтиПоНаименованию("Пользователь в рознице");
//Сообщить("НачалоУстановитьССылку");
Выполнить(Алгоритмы.ПослеЗагрузкиДокумента_УстановитьССылку);
