ПроведенОбъект = Объект.Проведен;
ПроведенСсылка = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Объект.Ссылка, "Проведен");
ПроведенСсылка = ?(ПроведенСсылка = Неопределено, Ложь, ПроведенСсылка);


//Если Объект.ЭтоНовый() Тогда
//	Объект.Комментарий = "#Загружен новый документ";
//Иначе
//	Если ПроведенОбъект = ПроведенСсылка Тогда
//		Объект.Комментарий = "#Изменен документ";
//	ИначеЕсли ПроведенСсылка Тогда
//		Объект.Комментарий = "#Отменено проведение документа";
//	Иначе
//		Объект.Комментарий = "#Проведен документ";
//	КонецЕсли;
//КонецЕсли;
