СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("57.03");
СчетКт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("90.01.2");
Объект.Ответственный = Справочники.Пользователи.НайтиПоНаименованию("Пользователь в рознице");

Если ОбъектМодифицирован ИЛИ НЕ ОбъектНайден Тогда
	Объект.Записать();
	ОбъектМодифицирован = Ложь;
КонецЕсли;	


РХ = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
РХ.Отбор.Регистратор.Значение = Объект.Ссылка;         
РХ.Прочитать();
РХ.Очистить();

Если ПараметрыОбъекта["Проведен"] Тогда
	новЗапись = РХ.Добавить();
	новЗапись.СчетКт = СчетКт;
	новЗапись.СчетДт = СчетДт;
	Если ЗначениеЗаполнено(ПараметрыОбъекта["СубконтоДт1"]) Тогда
		СубконтоДт1 = Справочники.Контрагенты.НайтиПоНаименованию(ПараметрыОбъекта["СубконтоДт1"]);
		БухгалтерскийУчет.УстановитьСубконто(новЗапись.СчетДт,новЗапись.СубконтоДт ,"Контрагенты",СубконтоДт1);
	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыОбъекта["СубконтоДт1"]) Тогда
		СубконтоДт2 = Справочники.ДоговорыКонтрагентов.НайтиПоНаименованию(ПараметрыОбъекта["СубконтоДт2"],,,СубконтоДт1);
		БухгалтерскийУчет.УстановитьСубконто(новЗапись.СчетДт,новЗапись.СубконтоДт ,"Договоры",СубконтоДт2);
	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыОбъекта["СубконтоКт1"]) Тогда
		СубконтоКт1 = Справочники.НоменклатурныеГруппы.НайтиПоНаименованию(ПараметрыОбъекта["СубконтоКт1"]);
		БухгалтерскийУчет.УстановитьСубконто(новЗапись.СчетКт,новЗапись.СубконтоКт ,"НоменклатурныеГруппы",СубконтоКт1);
	КонецЕсли;
	
	новЗапись.Период = Объект.Дата;
	новЗапись.Регистратор = Объект.Ссылка;
	новЗапись.Организация = Объект.Организация;
	новЗапись.Содержание = "Оплата банковской картой";
	новЗапись.Сумма = Объект.СуммаОперации;
	новЗапись.СуммаНУДт = новЗапись.Сумма;
	новЗапись.СуммаНУКт = новЗапись.Сумма;

КонецЕсли;
РХ.Записать();
